notes/2017-06-29_Books_recommended_Peterson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>2017-06-29_Books_recommended_Peterson</title>
<!-- 2017-06-29 Thu 12:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">2017-06-29_Books_recommended_Peterson</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. A Categorized Book List</a>
<ul>
<li><a href="#sec-1-1">1.1. Clinical Psychology and Personality</a></li>
<li><a href="#sec-1-2">1.2. General</a></li>
<li><a href="#sec-1-3">1.3. Religion and Religious History</a></li>
<li><a href="#sec-1-4">1.4. My Books</a></li>
<li><a href="#sec-1-5">1.5. Neuroscience</a></li>
<li><a href="#sec-1-6">1.6. Literature/Philosophy</a></li>
<li><a href="#sec-1-7">1.7. Biography</a></li>
<li><a href="#sec-1-8">1.8. History</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Book list</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://jordanbpeterson.com/2017/03/great-books/">A Categorized Book List</a></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Clinical Psychology and Personality</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>Sigmund Freud: The Interpretation of Dreams
</li>
<li>Carl Jung: Modern Man in Search of a Soul
</li>
<li>Carl Jung: Answer to Job
</li>
<li>Carl Jung: Archetypes of the Collective Unconscious
</li>
<li>Carl Jung: Aion
</li>
<li>Carl Jung: Psychology: East and West
</li>
<li>Carl Rogers: A Way of Being
</li>
<li>Carl Rogers: On Becoming a Person
</li>
<li>Jean Piaget: Play, Dreams and Imitation in Childhood
</li>
<li>Jean Piaget: The Moral Judgment of the Child
</li>
<li>Henri Ellenberger: The Discovery of the Unconscious
</li>
<li>Erich Neumann: The Origins and History of Consciousness
</li>
<li>Erich Neumann: The Great Mother
</li>
<li>Ernest Becker: The Denial of Death
</li>
<li>May, R., Angel, E., &amp; Ellenberger, H: Existence: A new dimension in psychiatry and psychology
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> General</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Derek J. de Solla Price: Little Science, Big Science
</li>
<li>Hans Eysenck: Genius
</li>
<li>Hernando De Soto: The Mystery of Capital: Why Capitalism Triumphs in the West and Fails Everywhere Else
</li>
<li>John Gall: Systemantics: How Systems Work and Especially How They Fail
</li>
<li>Theodore Dalrymple: Life at the Bottom: The Worldview That Makes the Underclass
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Religion and Religious History</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Huston Smith (introductory): The World’s Religions
</li>
<li>A History of Religious Ideas (Vol. 1, Vol. 2, Vol. 3) – Mircea Eliade
</li>
<li>Jeffrey Burton Russell: Mephistopheles: The Devil in the Modern World
</li>
<li>The Bible: Designed to be Read as Living Literature
</li>
<li>Bernard Lewis: The Crisis of Islam
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> My Books</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>Jordan B. Peterson: Maps of Meaning
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Neuroscience</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>Jeffrey Gray and Neil McNaughton: The Neuropsychology of Anxiety
</li>
<li>Jaak Panksepp: Affective Neuroscience
</li>
<li>Joseph LeDoux: The Emotional Brain
</li>
<li>Larry Swanson: Brain Architecture: Understanding the Basic Plan
</li>
<li>JJ Gibson: An Ecological Approach to Visual Perception
</li>
<li>Elkhonon Goldberg: The New Executive Brain
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Literature/Philosophy</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>Fyodor Dostoevsky: The Devils
</li>
<li>Fyodor Dostoevsky: The Idiot
</li>
<li>Nikos Kazantzakis: The Fratricides
</li>
<li>Nikos Kazantzakis: Zorba the Greek
</li>
<li>Mikhail Bulgakov: The Master and Margarita
</li>
<li>Solzhenitsyn: The First Circle
</li>
<li>Solzhenitsyn: Cancer Ward
</li>
<li>Friedrich Nietzsche: The Antichrist
</li>
<li>Friedrich Nietzsche: The Gay Science
</li>
<li>Northrop Frye: The Great Code
</li>
<li>Northrop Frye: Words with Power
</li>
<li>Robert Pirsig: Zen and the Art of Motorcycle Maintenance
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Biography</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>Henri Troyat: Tolstoy
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> History</h3>
<div class="outline-text-3" id="text-1-8">
<ol class="org-ol">
<li>Edvard Radzinsky: Stalin: The First In-depth Biography Based on Explosive New Documents from Russia’s Secret Archives
</li>
<li>Theodore M. Porter: The Rise of Statistical Thinking 1820-1900
</li>
<li>William L. Shirer: The Rise and Fall of the Third Reich
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://jordanbpeterson.com/2016/11/book-list/">Book list</a></h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Brave New World – Aldous Huxley
</li>
<li>1984 – George Orwell
</li>
<li>Road To Wigan Pier – George Orwell
</li>
<li>Crime And Punishment – Fyodor Dostoevsky
</li>
<li>Demons – Fyodor Dostoevsky
</li>
<li>Beyond Good And Evil – Friedrich Nietzsche
</li>
<li>Ordinary Men – Christopher Browning
</li>
<li>The Painted Bird – Jerzy Kosinski
</li>
<li>The Rape of Nanking – Iris Chang
</li>
<li>Gulag Archipelago (Vol. 1, Vol. 2, &amp; Vol. 3) – Aleksandr Solzhenitsyn
</li>
<li>Man’s Search for Meaning – Viktor Frankl
</li>
<li>Modern Man in Search of A Soul – Carl Jung
</li>
<li>Maps Of Meaning: The Architecture of Belief – Jordan B. Peterson
</li>
<li>A History of Religious Ideas (Vol. 1, Vol. 2, Vol. 3) – Mircea Eliade
</li>
<li>Affective Neuroscience – Jaak Panksepp
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-29 Thu 12:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
